Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Ready-to-use projects are available to run LVGL on macOS as well.
it_it: Sono disponibili progetti pronti all'uso per eseguire LVGL anche su macOS.

source: Real-time position and duration queries
it_it: Query di posizione e durata in tempo reale

source: Reapply Changes After Regeneration
it_it: Riapplicare le Modifiche Dopo la Rigenerazione

source: Reason: if you use :cpp:expr:`lv_label_set_text(label, new_text)`, a memory realloc() will be forced every time the length of the string changes.
it_it: Motivo: se si utilizza :cpp:expr:`lv_label_set_text(label, new_text)`, verrà forzata una realloc() di memoria ogni volta che la lunghezza della stringa cambia.

source: Reason: their content must remain valid through the life of the Subject.
it_it: Motivo: il loro contenuto deve rimanere valido per tutta la vita del Subject.

source: Recipe
it_it: Ricetta

source: Recipe Tasks
it_it: I Task della Ricetta

source: Recipes
it_it: Ricette

source: Recolor bars based on their value
it_it: Ricolorare le barre in base al loro valore

source: Recolor or transformation for images w/ opacity or alpha channel can't be obtained in a single G2D/PXP pipeline configuration.
it_it: La ricolorazione o la trasformazione di immagini con opacità o canale alfa non possono essere ottenute in una singola configurazione della pipeline G2D/PXP.

source: Recolor or transformation for images w/ opacity or alpha channel can't be obtained in a single PXP pipeline configuration.
it_it: La ricolorazione o la trasformazione di immagini con opacità o canale alfa non possono essere ottenute in una singola configurazione della pipeline PXP.

source: Recolor source image RGB565.
it_it: Ricolorare l'immagine sorgente RGB565.

source: Recolor source image.
it_it: Ricolorare l'immagine sorgente.

source: Recommended boards include the ESP32 (original dual-core) and the ESP32-S3.
it_it: Le schede consigliate includono ESP32 (dual-core originale) ed ESP32-S3.

source: Recommended configuration in **Arduino** environments:
it_it: Configurazione consigliata in ambienti **Arduino**:

source: Record refresh duration
it_it: Registra la durata del refresh

source: Record render duration
it_it: Registra la durata del render

source: Rectangle Draw Descriptor
it_it: Descrittore di Disegno del Rettangolo

source: Rectangle drawing, even with gradients
it_it: Disegno di rettangoli, anche con gradienti

source: Rectangles, text, images, lines, arcs, etc. can be drawn here using LVGL's extensive drawing engine.
it_it: Rettangoli, testo, immagini, linee, archi, ecc. possono essere disegnati utilizzando l'ampio motore di disegno di LVGL.

source: Reduce :c:macro:`LV_MEM_SIZE` in *lv_conf.h*.
it_it: Ridurre :c:macro:`LV_MEM_SIZE` in *lv_conf.h*.

source: Reduce the value of :c:macro:`LV_PROFILER_BUILTIN_BUF_SIZE` to fill the buffer more quickly and trigger automatic printing.
it_it: Ridurre il valore di :c:macro:`LV_PROFILER_BUILTIN_BUF_SIZE` per riempire il buffer più rapidamente e attivare la stampa automatica.

source: Refer reader to additional information using the ``@see`` command.
it_it: Indirizzare il lettore a informazioni aggiuntive utilizzando il comando ``@see``.

source: Refer to the README.md files in this repository for quick build and flash instructions.
it_it: Fare riferimento ai file README.md in tale repository per istruzioni rapide di compilazione e flashing.

source: Refer to the following ``Makefile`` for configuration:
it_it: Fare riferimento al seguente ``Makefile`` per la configurazione:

source: Reference
it_it: Riferimento

source: Reference Project
it_it: Progetto di Riferimento

source: Reference the link (anchor) by:
it_it: Fare riferimento al link (àncora) tramite:

source: Reference: https://wiki.videolan.org/YUV/
it_it: Riferimento: https://wiki.videolan.org/YUV/

source: Referencing API Documentation
it_it: Riferimento alla Documentazione API

source: Referencing properties
it_it: Riferimento alle proprietà

source: Refractive materials with realistic distortion effects revealing geometry behind surfaces
it_it: Materiali rifrangenti con effetti di distorsione realistici che rivelano la geometria dietro le superfici

source: Refresh Event
it_it: Evento del Refresh

source: Refresh interval start
it_it: Inizio intervallo di aggiornamento

source: Regardless of the state of any of the above macros, the function :cpp:expr:`lv_obj_dump_tree(widget)` provides a "dump" of the Widget Tree for the specified Widget (that Widget plus all its children recursively) using the currently-configured method used by the :c:macro:`LV_LOG_USER` macro.
it_it: Indipendentemente dallo stato di una qualsiasi delle macro sopra indicate, la funzione :cpp:expr:`lv_obj_dump_tree(widget)` fornisce un "dump" del Widget Tree per il Widget specificato (quello stesso Widget più tutti i suoi figli ricorsivamente) col metodo attualmente configurato usato dalla macro :c:macro:`LV_LOG_USER`.

source: Regardless, the XML file size can be reduced through so-called "minification".
it_it: In ogni caso, le dimensioni del file XML possono essere ridotte tramite la cosiddetta "minification".

source: Regenerate the image with the rootfs overlay updated.
it_it: Rigenerare l'immagine con l'overlay rootfs aggiornato.

source: Register ``globals.xml``\ s and those defining Components and Screens.
it_it: Registrare i file ``globals.xml`` e quelli che definiscono Componenti e Screen.

source: Register a widget
it_it: Registrare un widget

source: Register definitions and other EVE enumerations are available when you include ``lvgl.h`` under the prefix namespace ``LV_EVE_``.
it_it: Le definizioni dei registri e altre enumerazioni EVE sono disponibili includendo ``lvgl.h`` sotto il namespace con prefisso ``LV_EVE_``.

source: Register events, fonts, images, etc., that are compiled into the code so they are available for the Components and Screens registered later.
it_it: Registrare eventi, font, immagini, ecc., che vengono compilati nel codice in modo che siano disponibili per i Componenti e gli Screen registrati in seguito.

source: Registering External Data
it_it: Registrazione di Dati Esterni

source: Registering Fonts
it_it: Registrazione dei Font

source: Registering Images
it_it: Registrazione delle Immagini

source: Registering Manually
it_it: Registrazione Manuale

source: Registering Tests
it_it: Registrazione dei Test

source: Registering Widgets
it_it: Registrare Widget

source: Registering XML Files
it_it: Registrazione di File XML

source: Registering a driver
it_it: Registrazione di un driver

source: Registering an Image Decoder
it_it: Registrazione di un Decoder di Immagini

source: Registering from a Blob
it_it: Registrazione da un BLOB

source: Registration
it_it: Registrazione

source: Relation to Styles
it_it: Relazione con gli Stili

source: Relative paths
it_it: Path relativi

source: Relative to Widget's top left corner'
it_it: Relativamente all'angolo in alto a sinistra del Widget.

source: Release cycle
it_it: Ciclo di rilascio

source: Release date
it_it: Data di rilascio

source: Release policy
it_it: Policy di rilascio

source: Reliability
it_it: Affidabilità

source: Remember, when you are writing source code, you are not just teaching the computer what to do, but also teaching other programmers how it works, not only users of the API, but also future maintainers of your source code.
it_it: Da ricordare, quando si scrive codice sorgente, non si sta solo insegnando al computer cosa fare, ma anche insegnando ad altri programmatori come funziona, non solo agli utenti dell'API, ma anche ai futuri manutentori del codice sorgente.

source: Reminder: Note carefully that the prefixed "Z:" has nothing to do with the "C:" and "D:" Windows/DOS drive letters in 3 of the above examples, which are part of the path.
it_it: Promemoria: Si noti che il prefisso "Z:" non ha nulla a che fare con le lettere di unità Windows/DOS "C:" e "D:" in 3 dei file esempi sopra, che fanno parte del path.

source: Removing Event(s) from Widgets
it_it: Rimozione di Eventi dai Widget

source: Removing Styles
it_it: Rimozione degli Stili

source: Removing Styles Makes Coordinates Disappear
it_it: La Rimozione degli Stili fa Scomparire le Coordinate

source: Removing a Span
it_it: Rimozione di uno Span

source: Renaming tabs
it_it: Rinominare le schede

source: Render SVGs and vector graphics natively on ST's NeoChrom and other NemaGFX compatible GPUs.
it_it: Rendering di SVG e grafica vettoriale in modo nativo su NeoChrom di ST e altre GPU compatibili con NemaGFX.

source: Render time start
it_it: Ora inizio rendering

source: Rendering & Lighting
it_it: Rendering & Illuminazione

source: Rendering Backends
it_it: Backend di Rendering

source: Rendering Quality
it_it: Qualità del Rendering

source: Rendering vector fonts is supported with VGLite or ThorVG, when using vector fonts with ThorVG, it is possible to set a letter outline of a different color.
it_it: Il rendering dei font vettoriali è supportato da VGLite o ThorVG; quando si utilizzano font vettoriali con ThorVG, è possibile impostare un contorno delle lettere di un colore diverso.

source: Renesas MPUs (i.e., the RZ/G family) can use these LVGL MPU drivers.
it_it: Le MPU Renesas (ovvero la famiglia RZ/G) possono utilizzare questi driver MPU LVGL.

source: Renesas' Flexible Software Package (FSP) includes BSP and HAL layer support extended with multiple RTOS variants and other middleware stacks.
it_it: Il Flexible Software Package (FSP) di Renesas include il supporto per i livelli BSP e HAL, esteso a diverse varianti di RTOS e altri stack middleware.

source: Renesas' Smart Configurator (SMC) includes BSP and HAL layer support extended with multiple RTOS variants and other middleware stacks.
it_it: Lo Smart Configurator (SMC) di Renesas include il supporto per i layer BSP e HAL esteso a più varianti RTOS e altri stack middleware.

source: Repeat Count
it_it: Conteggio Ripetizioni

source: Repeatedly decoding a PNG/JPEG image or loading images from a slow external memory would be inefficient and detrimental to the user experience.
it_it: Decodificare ripetutamente un'immagine PNG/JPEG o caricare immagini da una memoria esterna lenta sarebbe inefficiente e dannoso per l'esperienza utente.

source: Replace the global/static local var with :cpp:expr:`(LV_GLOBAL_DEFAULT()->_var)`
it_it: Sostituire la variabile locale globale/statica con :cpp:expr:`(LV_GLOBAL_DEFAULT()->_var)`

source: Replacing Styles
it_it: Sostituzione di Stili

source: Reporting Style Changes
it_it: Segnalare le Modifiche di Stile

source: Repository layout
it_it: Layout del repository

source: Representation of a project may be further defined and clarified by project maintainers.
it_it: La rappresentanza di un progetto può essere ulteriormente definita e chiarita dai responsabili del progetto.

source: Required linked libraries: -lGL -lglfw
it_it: Librerie linkate richieste: -lGL -lglfw

source: Required linked libraries: ``-lSDL2``
it_it: Librerie linkate richieste: ``-lSDL2``

source: Required properties:
it_it: Proprietà richieste:

source: Requirements
it_it: Requisiti

source: Requires ``LV_USE_FLOAT``.
it_it: Richiede ``LV_USE_FLOAT``.

source: Requires ``LV_USE_LABEL = 1`` in lv_conf.h
it_it: Richiede ``LV_USE_LABEL = 1`` in lv_conf.h

source: Requires ``LV_USE_OBSERVER = 1`` in lv_conf.h
it_it: Richiede ``LV_USE_OBSERVER = 1`` in lv_conf.h

source: Requires ``LV_USE_SYSMON = 1`` in lv_conf.h
it_it: Richiede ``LV_USE_SYSMON = 1`` in lv_conf.h

source: Requires a draw unit to be enabled which can draw the :cpp:enumerator:`LV_DRAW_TASK_TYPE_3D` draw task type.
it_it: Richiede l'abilitazione di una "unità draw" in grado di eseguire il tipo di task :cpp:enumerator:`LV_DRAW_TASK_TYPE_3D` per il disegno.

source: Requires a negative minimum value and positive maximum value, e.g. [-100..100].
it_it: Richiede un valore minimo negativo e un valore massimo positivo, ad esempio [-100..100].

source: Requires an MMU as the design mandates separation among processes
it_it: Richiede una MMU poiché la progettazione impone la separazione tra i processi

source: Requires negative minimum range and positive maximum range.
it_it: Richiede un intervallo minimo negativo e un intervallo massimo positivo.

source: Reset the board and using the 'NSH>' terminal start the LVGL demo:
it_it: Resettare la scheda e, usando il terminale 'NSH>', avviare la demo LVGL:

source: Reset zoom
it_it: Resetta lo zoom

source: Resolution (width and height in pixels)
it_it: Risoluzione (larghezza e altezza in pixel)

source: Resolution: 1024x600
it_it: Risoluzione: 1024x600

source: Restart e2 Studio if prompted.
it_it: Riavviare e2 Studio se richiesto.

source: Restrictions
it_it: Restrizioni

source: Result of Clip Corner Style
it_it: Risultato delllo Stile "Clip Corner"

source: Result: "Click My Heading for more details."
it_it: Risultato: "Cliccare My Heading per maggiori dettagli.."

source: Result: "Click here for more details."
it_it: Risultato: "Cliccare qui per maggiori dettagli."

source: Result: "The temperature outside is 20°C."
it_it: Risultato: "La temperatura esterna è di 20°C."

source: Resuming a timer is typically safe in an interrupt handler.
it_it: Riprendere un timer è in genere sicuro in un gestore di interrupt.

source: Retrieving a Span child
it_it: Recupero di uno Span figlio

source: Returns
it_it: Valori di Ritorno

source: Returns :cpp:enumerator:`LV_RESULT_OK` if there is a valid pressed date; otherwise it returns :cpp:enumerator:`LV_RESULT_INVALID`.
it_it: Restituisce :cpp:enumerator:`LV_RESULT_OK` se è presente una data premuta valida; in caso contrario restituisce :cpp:enumerator:`LV_RESULT_INVALID`.

source: Right Panel
it_it: Pannelo Destro

source: Right to left scrolling
it_it: Scorrimento da destra a sinistra

source: Rlottie Patch File
it_it: File di Patch per Rlottie

source: Rlottie Player
it_it: Player Rlottie

source: Rlottie can be expensive to render on embedded hardware.
it_it: Il rendering di Rlottie può essere costoso su hardware embedded.

source: Rlottie is deprecated.
it_it: Rlottie è deprecato.

source: Rlottie relies on dynamic linking for an image loader lib.
it_it: Rlottie si basa sul linking dinamico per una libreria di loader di immagini.

source: Rlottie will not compile for the IDF using the ``-02`` compiler option at this time.
it_it: Rlottie non compilerà per l'IDF utilizzando l'opzione del compilatore ``-02`` al momento.

source: Roller allows the end user to select an item from a list by scrolling through it.
it_it: Il Roller consente all'utente finale di selezionare un elemento da una lista scorrendola.

source: Root back button mode
it_it: Modalità del pulsante Root back

source: Root password to ``lvgl-buildroot`` under ``system_configuration > Root password``.
it_it: Password di root in ``lvgl-buildroot`` in ``system_configuration > Root password``.

source: Rotate Widget.
it_it: Ruota il Widget.

source: Rotate and zoom
it_it: Rotazione e zoom

source: Rotate screen (90, 180, 270 degree).
it_it: Ruotare lo schermo (90, 180, 270 gradi).

source: Rotation
it_it: Rotazione

source: Rotation is not currently supported
it_it: La rotazione non è attualmente supportata

source: Rotation is not supported for images unaligned to blocks of 16x16 pixels.
it_it: La rotazione non è supportata per le immagini non allineate a blocchi di 16x16 pixel.

source: Rotation support (0°, 90°, 180°, 270°)
it_it: Supporto alla rotazione (0°, 90°, 180°, 270°)

source: Rotation support for the SHM backend
it_it: Supporto alla rotazione per il backend SHM

source: Roughness and metallic workflow textures
it_it: Texture per workflow di rugosità e metalliche

source: Rounds the arc ends.
it_it: Arrotonda le estremità dell'arco.

source: Rounds the line end.
it_it: Arrotonda la fine della linea.

source: Rounds the line start.
it_it: Arrotonda l'inizio della linea.

source: Row and column will be set to :c:macro:`LV_TABLE_CELL_NONE` if no cell is selected.
it_it: Riga e colonna verranno impostate su :c:macro:`LV_TABLE_CELL_NONE` se non è selezionata alcuna cella.

source: Rows and Columns
it_it: Righe e Colonne

source: Rules for allowed values of ``extends``:
it_it: Regole per i valori consentiti di ``extends``:

source: Run ``code-format.py`` from the ``scripts`` folder.
it_it: Eseguire ``code-format.py`` dalla cartella ``scripts``.

source: Run ``systemctl stop weston`` in the terminal.
it_it: Eseguire ``systemctl stop weston`` nel terminale.

source: Run it with no arguments to see its command-line options.
it_it: Eseguirlo senza argomenti per visualizzarne le opzioni da riga di comando.

source: Run tests from a single file.
it_it: Esegue test da un singolo file.

source: Run the Project
it_it: Esecuzione del Progetto

source: Run the UI scenario that you want to measure, such as scrolling a scrollable page up and down or entering/exiting an application.
it_it: Eseguire lo scenario dell'interfaccia utente da misurare, ad esempio lo scorrimento di una pagina "scrollable" verso l'alto e verso il basso o l'ingresso/uscita da un'applicazione.

source: Run the ``<test>``\ (s) from the XML files
it_it: Eseguire i ``<test>`` dai file XML

source: Run the event loop.
it_it: Eseguire il "loop" di eventi.

source: Run the following commands to enable it:
it_it: Eseguire i seguenti comandi per abilitarla:

source: Run the project:
it_it: Esecuzione del progetto

source: Run the test scenario
it_it: Eseguire lo scenario di test

source: Run this command to ensure the binary was generated and was installed in the rootfs
it_it: Eseguire questo comando per assicurarsi che il binario sia stato generato e installato nel rootfs.

source: Run-Time Object Hierarchy
it_it: Gerarchia degli Oggetti a Run-Time

source: Running Tests
it_it: Esecuzione dei Test

source: Running on PC
it_it: Esecuzione su un PC

source: Running the NuttX Simulator
it_it: Esecuzione del Simulatore NuttX

source: Running this script creates an output folder that contains everything the process will generate:
it_it: L'esecuzione di questo script crea una cartella di output che contiene tutto ciò che il processo genererà:

source: Running under Embedded Linux
it_it: Esecuzione su Embedded Linux

source: Runtime Node Manipulation
it_it: Manipolazione dei Nodi in a Runtime

source: SCATTER charts have separate data-value arrays for both X-values and Y-values.
it_it: I grafici a dispersione hanno array di valori dati separati sia per i valori X che per i valori Y.

source: SCATTER-type charts also use an array of X-values.).
it_it: Anche i grafici di tipo SCATTER utilizzano un array di valori X).

source: SDK generation
it_it: Generazione dell'SDK

source: SDL Driver
it_it: Driver SDL

source: SDL on Linux
it_it: SDL su Linux

source: SET when the Subject's integer value fulfills the indicated condition, and
it_it: SET quando il valore intero del Subject soddisfa la condizione indicata e

source: SET when the Subject's integer value is non-zero.
it_it: SET quando il valore intero del Subject è diverso da zero.

source: SHM Backend (Default)
it_it: SHM Backend (Il default)

source: SPI Display Driver Creation for STM32
it_it: Creazione di Driver per Display SPI per STM32

source: ST7735 LCD Controller Driver
it_it: Driver del Controller LCD ST7735

source: ST7789 LCD Controller Driver
it_it: Driver per Controller LCD ST7789

source: ST7796 LCD Controller Driver
it_it: Driver per Controller LCD ST7796

source: STDIO (Linux and Windows using C standard function .e.g ``fopen``, ``fread``)
it_it: STDIO (Linux e Windows che utilizzano le funzioni standard del C, ad esempio ``fopen``, ``fread``)

source: STM32 DMA2D is also called Chrom-ART.
it_it: STM32 DMA2D è anche chiamato Chrom-ART.

source: STM32 Embedded Displays
it_it: Display embedded STM32

source: STM32 LTDC Display Driver
it_it: Driver del display LTDC STM32

source: STM32 projects can be created with STM32CubeIDE or with other frameworks that don't use the STM32 HAL.
it_it: I progetti STM32 possono essere creati con STM32CubeIDE o con altri framework che non utilizzano STM32 HAL.

source: STM32CubeIDE can optionally generate projects that use FreeRTOS.
it_it: STM32CubeIDE può facoltativamente generare progetti che utilizzano FreeRTOS.

source: STM32CubeIDE is an Eclipse-based IDE which is typically used to develop for STM32.
it_it: STM32CubeIDE è un IDE basato su Eclipse, generalmente utilizzato per lo sviluppo per STM32.

source: STMicroelectronics is a chip vendor and board manufacturer of 32-bit ARM MCUs and MPUs.
it_it: STMicroelectronics è un fornitore di chip e produttore di schede per MCU e MPU ARM a 32 bit.

source: SVG Decoder
it_it: Decoder SVG

source: Safety certification to various automotive, industrial and medical standards
it_it: Certificazione di sicurezza secondo vari standard automobilistici, industriali e medicali

source: Same as ``scale_x`` but for vertical scaling.
it_it: Come ``scale_x`` ma per il ridimensionamento verticale.

source: Save the file and then rebuild the project, this will be sufficient to add the PPA code and it will start to run automatically, so no further steps are required from the user code perspective.
it_it: Salvare il file e poi ri-eseguire la build del progetto. Sarà sufficiente aggiungere il codice PPA e l'esecuzione inizierà automaticamente, quindi non sono necessari ulteriori passaggi dal punto di vista del codice utente.

source: Save the output log as `my_trace.txt`, use `trace_filter.py` for filtering and preprocessing:
it_it: Salvare il log di output come `my_trace.txt`, usare `trace_filter.py` per il filtraggio e la pre-elaborazione:

source: Save the touch events asynchronously in the ``touches`` array (one event per finger)
it_it: Salva gli eventi touch in modo asincrono nell'array ``touches`` (un evento per dito)

source: Saving a defconfig
it_it: Salvataggio di un defconfig

source: Scalable: able to operate with little memory (64 kB Flash, 16 kB RAM)
it_it: Scalabile: in grado di funzionare con poca memoria (64 kB Flash, 16 kB RAM)

source: Scale source image ARGB8888.
it_it: Ridimensionare l'immagine sorgente ARGB8888.

source: Scale Section Min/Max values
it_it: Valori Min/Max della Sezione "Scale"

source: Scale Widgets show linear or circular scales with configurable ranges, tick counts, placement, labeling, and subsections (:ref:`scale_sections`) with custom styling.
it_it: I Widget "Scale" mostrano scale lineari o circolari con intervalli, conteggi di tacche, posizionamento, etichettatura e sottosezioni (:ref:`scale_sections`) configurabili con stile personalizzato.

source: Scale and rotate (90, 180, 270 degree) source image RGB565.
it_it: Ridimensionare e ruotare (90, 180, 270 gradi) l'immagine sorgente RGB565.

source: Scale and rotate (any decimal degree) source image.
it_it: Ridimensionare e ruotare (90, 180, 270 gradi) l'immagine sorgente RGB565.

source: Scale down all opacity values of the Widget by this factor.
it_it: Riduce tutti i valori di opacità del Widget di questo fattore.

source: Scale/Zoom, where 256 means 100%, 128 means 50%, 512 means 200% etc.
it_it: Scala/Zoom, dove 256 indica il 100%, 128 il 50%, 512 il 200% ecc.

source: Scatter chart
it_it: Grafico a dispersione

source: Scope
it_it: Ambito di Applicazione

source: Screen Layers
it_it: Layer dello Screen

source: Screen Load and Create events
it_it: Eventi di Caricamento e Creazione delle Schermate

source: Screen rotation
it_it: Rotazione dello schermo

source: Screens
it_it: Screen

source: Screens are created like this:
it_it: Gli Screen vengono creati in questo modo:

source: Screens are created on the :ref:`Default display <default_display>`.
it_it: Gli Screen vengono creati sul :ref:`Display di Default <default_display>`.
